Merge pull request #20 from open-experiments/solution-diagram
